<?php
	require_once 'settingDB.php';

//------------------------------------------------------------------------------------------//
//					ПОДКЛЮЧЕНИЕ К БД
//------------------------------------------------------------------------------------------//
	$connestion = new PDO(
		/*адрес БД*/'mysql:host=localhost;'.
		/*имя БД*/'dbname=mysite;'.
		/*порт*/'port=4000;' . 
		/*кодировка*/ 'charset=utf8',

		/*пользователь БД*/'root',
		/*пароль пользователя*/'root'
	);


//------------------------------------------------------------------------------------------//
//					ПРОСТОЙ СЕЛЕКТ ЗАПРОС
//------------------------------------------------------------------------------------------//

	// $dataUsers = $connestion->query("SELECT * FROM users");

	// $valueUsers = $dataUsers->rowCount();
	// for($numberUser=0; $numberUser<$valueUsers; ++$numberUser){
	// 	[$id, $name, $age, $login] = $dataUsers->fetch();
	// 	echo 'name: ' . $name . '. login: ' . $login . '<br/>';
	// }

//------------------------------------------------------------------------------------------//
//					ПОДГОТОВЛЕННЫЙ ЗАПРОС. (ЗАЩИТА ОТ SQL-ИНЪЕКЦИИ)
//------------------------------------------------------------------------------------------//

	// $name = "Bob2";
	// $age = 32;
	// $login = 'user1';

	// $sql  = 'INSERT users (name, age, login) VALUE (:setName, :setAge, :setLogin)';
	// $query = $connestion->prepare($sql);
	// $query->execute([
	// 	'setName' => $name, 
	// 	'setAge' => $age,
	// 	'setLogin' => $login
	// ]);
?>